app/Services/CountryService.php

    public function getAll()
    {
        return Country::all();
---
select * from "countries"