app/Services/DepartementService.php

select * from "departements"
---
    public function getAll()
    {
        return Departement::all();

insert into "departements" ("name", "description", "updated_at", "created_at") values ('dev', '<p>dev desc</p>', '2024-12-17 22:51:16', '2024-12-17 22:51:16')
insert into "images" ("path", "imageable_id", "imageable_type", "updated_at", "created_at") values ('images/departements/KOFYLCh6pK93XIyk1EUQVHXjIrwl2Ku91JJaCZ40.png', 1, 'App\Models\Departement', '2024-12-17 22:51:16', '2024-12-17 22:51:16')
---
    public function create(array $data)
    {
        $departement = Departement::create($data);
        if (isset($data['logo'])) {
            $imagePath = $data['logo']->store('images/departements', 'public');
            $departement->logo()->create(['path' => $imagePath]);