app/Services/EventService.php

select * from `events`
---
    public function getAll()
    {
        return Event::all();