app/Services/EventCategoryService.php

insert into "event_categories" ("name", "description", "status", "updated_at", "created_at") values ('cat ev 1', null, 'Actif', '2024-12-08 08:46:27', '2024-12-08 08:46:27')
---
    public function create(array $data): EventCategory
    {
        return EventCategory::create($data);