app/Services/NewService.php

select * from "news"
---
    public function getAll()
    {
        return News::all();