app/Services/PartnerService.php

    public function create(array $data): Partner
    {
        $partner = Partner::create($data);
---
insert into "partners" ("url", "updated_at", "created_at") values ('https://www.google.committing', '2024-12-15 17:45:28', '2024-12-15 17:45:28')

    public function update(Partner $partner, array $data): Partner
    {
        $partner->update($data);
        if (isset($data['image'])) {
            $imagePath = $data['image']->store('images/partners', 'public');
            if ($partner->logo) {
                $partner->logo->delete();
            }
            $partner->logo()->create(['path' => $imagePath]);
---
update "partners" set "url" = 'https://www.google.io', "image" = 'images/partners/9W0XTCfAaNoLiXq2eXEfShvxeyDsn3V6UDW0KqOL.png', "updated_at" = '2024-12-15 13:26:35' where "id" = 1
insert into "images" ("path", "imageable_id", "imageable_type", "updated_at", "created_at") values ('images/partners/oembrT6mjdkhP61apPzchkpn9oiFTNXmrEVVTreL.png', 2, 'App\Models\Partner', '2024-12-15 17:40:44', '2024-12-15 17:40:44')

    public function delete(Partner $partner)
    {
        if ($partner->logo) {
            $partner->logo->delete();
        }
        return $partner->delete();
---
delete from "partners" where "id" = 1

    public function getAll()
    {
        return Partner::all();
---
select * from "partners"