app/Services/PortfolioService.php

    public function getAll()
    {
        return Portfolio::with(['departement'])->get();
---
select * from "departements" where "departements"."id" in (1)
select * from "portfolios"

    public function create(array $data)
    {
        $portfolio = Portfolio::create($data);
        if (isset($data['image'])) {
            $imagePath = $data['image']->store('images/portfolios', 'public');
            $portfolio->image()->create(['path' => $imagePath]);
---
insert into "portfolios" ("departement_id", "name", "slug", "description", "updated_at", "created_at") values ('1', 'rlst 2', 'rlst-2', '<p>a desc</p>', '2024-12-17 22:25:30', '2024-12-17 22:25:30')
insert into "images" ("path", "imageable_id", "imageable_type", "updated_at", "created_at") values ('images/services/2bcVxN2ySGW9MrNtwCcwj7rJWivuB2LJEwpkc9U1.png', 1, 'App\Models\Portfolio', '2024-12-17 22:25:30', '2024-12-17 22:25:30')