app/Services/ServiceCategoryService.php

    public function getAll()
    {
        return ServiceCategory::all();
---
select * from "service_categories"

    public function create(array $data)
    {
        return ServiceCategory::create($data);
---
insert into "service_categories" ("name", "updated_at", "created_at") values ('dev', '2024-12-04 06:07:16', '2024-12-04 06:07:16')