app/Services/ServiceService.php

    public function getAll()
    {
        return Service::with(['category', 'departement'])->get();
---
select * from "departements" where "departements"."id" in (1)
select * from "services"

    public function update(Service $service, array $data)
    {
        $service->update($data);
        if (isset($data['image'])) {
            $imagePath = $data['image']->store('images/services', 'public');
            if ($service->image) {
                // delete the image
                $service->image->delete();
            }
            $service->image()->create(['path' => $imagePath]);
---
update "services" set "name" = 'mobile dev', "updated_at" = '2024-12-17 22:52:25' where "id" = 1
delete from "images" where "id" = 4
insert into "images" ("path", "imageable_id", "imageable_type", "updated_at", "created_at") values ('images/services/WIdWty4dB7VLu351av0Q8SWWSxzDjSJcT7hwvqcc.png', 1, 'App\Models\Service', '2024-12-17 22:52:25', '2024-12-17 22:52:25')

    public function delete(Service $service)
    {
        if ($service->image) {
            $service->image->delete();
        }
        return $service->delete();
---
delete from "images" where "id" = 5
delete from "services" where "id" = 1