app/Services/TeamService.php

update "teams" set "profession" = 'dev full', "updated_at" = '2024-12-17 05:04:21' where "id" = 1
insert into "images" ("path", "imageable_id", "imageable_type", "updated_at", "created_at") values ('images/teams/mHKz6T35XIdUZJsix2oSR3kVVQ7h9sRV5adtC3fK.jpg', 1, 'App\Models\Team', '2024-12-17 05:04:21', '2024-12-17 05:04:21')
---
    public function update(Team $team, array $data): Team
    {
        $team->update($data);
        if (isset($data['avatar'])) {
            $imagePath = $data['avatar']->store('images/teams', 'public');
            if ($team->avatar) {
                $team->avatar()->delete();
            }
            $team->avatar()->create(['path' => $imagePath]);

delete from "teams" where "id" = 2
---
    public function delete(Team $team)
    {
        if ($team->avatar) {
            $team->avatar()->delete();

select * from "teams"
---
    public function getAll()
    {
        return Team::all();