app/Services/TestimonialService.php

insert into "temoignages" ("nom", "profession", "message", "updated_at", "created_at") values ('Vivien Ogoun', 'dev', '<p>a msg</p>', '2024-12-17 22:49:43', '2024-12-17 22:49:43')
insert into "images" ("path", "imageable_id", "imageable_type", "updated_at", "created_at") values ('images/testimonials/MH5rlXQZv6vUphzcsog54JOH2fsdWWtRValVesQC.png', 1, 'App\Models\Temoignage', '2024-12-17 22:49:43', '2024-12-17 22:49:43')
---
    public function create(array $data): Temoignage
    {
        $testimonial = Temoignage::create($data);
        if (isset($data['avatar'])) {
            $imagePath = $data['avatar']->store('images/testimonials', 'public');
            $testimonial->avatar()->create(['path' => $imagePath]);

insert into "images" ("path", "imageable_id", "imageable_type", "updated_at", "created_at") values ('images/testimonials/85Dc5FxxWpTraB7yHdEFMYJxmgqB1zLLPy6KQB9l.jpg', 1, 'App\Models\Temoignage', '2024-12-17 22:49:58', '2024-12-17 22:49:58')
---
    public function update(Temoignage $testimonial, array $data): Temoignage
    {
        $testimonial->update($data);
        if (isset($data['avatar'])) {
            $imagePath = $data['avatar']->store('images/testimonials', 'public');
            if ($testimonial->avatar) {
                // delete the avatar
                $testimonial->avatar->delete();
            }
            $testimonial->avatar()->create(['path' => $imagePath]);