app/Http/Controllers/Api/NewsletterController.php

select * from "newsletters"
---
    public function index()
    {
        $emails = Newsletter::all();