app/Http/Controllers/Frontend/CoursePageController.php

    function index() : View {
        $categories = CourseCategory::active()->whereNull('parent_id')->with(['translation'])->get();
        $languages = CourseLanguage::where('status', 1)->get();
        $levels = CourseLevel::where('status', 1)->with('translation')->get();
---
select * from `course_languages` where `status` = 1
select * from `course_levels` where `status` = 1