app/Http/Controllers/Admin/EventController.php

    public function create()
    {
        $categories = EventCategory::all();
        $countries = Country::all();
        $departements = Departement::all();
---
select * from "event_categories"
select * from "countries"
select * from "departements"