app/Http/Controllers/Admin/NewController.php

select * from "countries"
---
    public function create()
    {
        // $categories = EventCategory::all();
        $countries = Country::all();