app/Http/Controllers/Admin/PartnerController.php

select * from "partners" where "partners"."id" = '4' limit 1
---
    public function edit($id)
    {
        $partner = Partner::findOrFail($id);

select * from "partners" where "partners"."id" = '2' limit 1
---
    public function update(StorePartnerRequest $request, $id)
    {
        $partner = Partner::findOrFail($id);

select * from "partners" where "partners"."id" = '1' limit 1
---
    public function destroy($id)
    {
        $partner = Partner::findOrFail($id);