app/Http/Controllers/Admin/PortfolioController.php

select * from "departements"
---
    public function create()
    {
        $departements = Departement::all();