app/Http/Controllers/Admin/ServiceController.php

    public function create()
    {
        $serviceCategories = ServiceCategory::all();
        $departements = Departement::all();
---
select * from "service_categories"
select * from "departements"

    public function update(StoreServiceRequest $request, $id)
    {
        $service = Service::findOrFail($id);
---
select * from "services" where "services"."id" = '1' limit 1

    public function destroy($id)
    {
        $service = Service::findOrFail($id);
---
select * from "services" where "services"."id" = '1' limit 1