app/Http/Controllers/Admin/TeamController.php

select * from "teams" where "teams"."id" = '1' limit 1
---
    public function edit($id)
    {
        $team = Team::findOrFail($id);

select * from "teams" where "teams"."id" = '1' limit 1
---
    public function update(StoreTeamRequest $request, $id)
    {
        $team = Team::findOrFail($id);

select * from "teams" where "teams"."id" = '2' limit 1
---
    public function destroy($id)
    {
        $team = Team::findOrFail($id);