app/Http/Controllers/Admin/TestimonialController.php

select * from "temoignages" where "temoignages"."id" = '1' limit 1
---
    public function update(StoreTestimonialRequest $request, $id)
    {
        $testimonial = Temoignage::findOrFail($id);